test/cassettes/refunds/create.yml


-
    request:
        method: POST
        url: 'https://api.easypost.com/v2/shipments'
        headers:
            Host: api.easypost.com
            Expect: ''
            Accept-Encoding: ''
            Accept: application/json
            Authorization: ''
            Content-Type: application/json
            User-Agent: ''
        body: '{"shipment":{"to_address":{"name":"Jack Sparrow","street1":"388 Townsend St","street2":"Apt 20","city":"San Francisco","state":"CA","zip":"94107","country":"US","email":"test@example.com","phone":"5555555555"},"from_address":{"name":"Elizabeth Swan","street1":"179 N Harbor Dr","city":"Redondo Beach","state":"CA","zip":"90277","country":"US","email":"test@example.com","phone":"5555555555"},"parcel":{"length":"10","width":"8","height":"4","weight":"15.4"},"service":"GroundAdvantage","carrier_accounts":["ca_8dc116debcdb49b5a66a2ddee4612600"],"carrier":"USPS"}}'
    response:
        status:
            code: 201
            message: Created
        headers:
            x-frame-options: SAMEORIGIN
            x-xss-protection: '1; mode=block'
            x-content-type-options: nosniff
            x-download-options: noopen
            x-permitted-cross-domain-policies: none
            referrer-policy: strict-origin-when-cross-origin
            x-ep-request-uuid: e181587c66bcebc8e2b8fb540086c846
            cache-control: 'private, no-cache, no-store'
            pragma: no-cache
            expires: '0'
            location: /api/v2/shipments/shp_c1bfabbf012845fca34e61aa50ad0d19
            content-type: 'application/json; charset=utf-8'
            content-length: '6549'
            x-runtime: '1.027818'
            x-node: bigweb33nuq
            x-version-label: easypost-202408141633-8ef9a7bcc9-master
            x-backend: easypost
            x-proxied: ['intlb4nuq c0f5e722d1', 'extlb2nuq b6e1b5034c']
            strict-transport-security: 'max-age=31536000; includeSubDomains; preload'
        body: '{"created_at":"2024-08-14T17:39:21Z","is_return":false,"messages":[],"mode":"test","options":{"currency":"USD","payment":{"type":"SENDER"},"date_advance":0},"reference":null,"status":"unknown","tracking_code":"9400100105807075196603","updated_at":"2024-08-14T17:39:21Z","batch_id":null,"batch_status":null,"batch_message":null,"customs_info":null,"from_address":{"id":"adr_2376e09c5a6411efb7a23cecef1b359e","object":"Address","created_at":"2024-08-14T17:39:20+00:00","updated_at":"2024-08-14T17:39:20+00:00","name":"Elizabeth Swan","company":null,"street1":"179 N Harbor Dr","street2":null,"city":"Redondo Beach","state":"CA","zip":"90277","country":"US","phone":"<REDACTED>","email":"<REDACTED>","mode":"test","carrier_facility":null,"residential":null,"federal_tax_id":null,"state_tax_id":null,"verifications":[]},"insurance":"50.00","order_id":null,"parcel":{"id":"prcl_6590bfc884a3414aa2cf33d6d018f058","object":"Parcel","created_at":"2024-08-14T17:39:21Z","updated_at":"2024-08-14T17:39:21Z","length":10,"width":8,"height":4,"predefined_package":null,"weight":15.4,"mode":"test"},"postage_label":{"object":"PostageLabel","id":"pl_c371b9a83d2e40828f977234bff49444","created_at":"2024-08-14T17:39:21Z","updated_at":"2024-08-14T17:39:21Z","date_advance":0,"integrated_form":"none","label_date":"2024-08-14T17:39:21Z","label_resolution":300,"label_size":"4x6","label_type":"default","label_file_type":"image\/png","label_url":"https:\/\/easypost-files.s3.us-west-2.amazonaws.com\/files\/postage_label\/20240814\/e84524d20967dd4c589363e13df3322730.png","label_pdf_url":null,"label_zpl_url":null,"label_epl2_url":null,"label_file":null},"rates":[{"id":"rate_42d52c8debaa407aa90dda98e42f9aba","object":"Rate","created_at":"2024-08-14T17:39:21Z","updated_at":"2024-08-14T17:39:21Z","mode":"test","service":"GroundAdvantage","carrier":"USPS","rate":"5.93","currency":"USD","retail_rate":"8.45","retail_currency":"USD","list_rate":"6.40","list_currency":"USD","billing_type":"easypost","delivery_days":3,"delivery_date":null,"delivery_date_guaranteed":false,"est_delivery_days":3,"shipment_id":"shp_c1bfabbf012845fca34e61aa50ad0d19","carrier_account_id":"ca_8dc116debcdb49b5a66a2ddee4612600"},{"id":"rate_5bb7787808c24d1eafda6bf31e477564","object":"Rate","created_at":"2024-08-14T17:39:21Z","updated_at":"2024-08-14T17:39:21Z","mode":"test","service":"Express","carrier":"USPS","rate":"33.10","currency":"USD","retail_rate":"37.90","retail_currency":"USD","list_rate":"33.10","list_currency":"USD","billing_type":"easypost","delivery_days":1,"delivery_date":null,"delivery_date_guaranteed":false,"est_delivery_days":1,"shipment_id":"shp_c1bfabbf012845fca34e61aa50ad0d19","carrier_account_id":"ca_8dc116debcdb49b5a66a2ddee4612600"},{"id":"rate_b77ef8611454491ca817c5633216d5a9","object":"Rate","created_at":"2024-08-14T17:39:21Z","updated_at":"2024-08-14T17:39:21Z","mode":"test","service":"Priority","carrier":"USPS","rate":"6.90","currency":"USD","retail_rate":"9.80","retail_currency":"USD","list_rate":"8.25","list_currency":"USD","billing_type":"easypost","delivery_days":2,"delivery_date":null,"delivery_date_guaranteed":false,"est_delivery_days":2,"shipment_id":"shp_c1bfabbf012845fca34e61aa50ad0d19","carrier_account_id":"ca_8dc116debcdb49b5a66a2ddee4612600"}],"refund_status":null,"scan_form":null,"selected_rate":{"id":"rate_42d52c8debaa407aa90dda98e42f9aba","object":"Rate","created_at":"2024-08-14T17:39:21Z","updated_at":"2024-08-14T17:39:21Z","mode":"test","service":"GroundAdvantage","carrier":"USPS","rate":"5.93","currency":"USD","retail_rate":"8.45","retail_currency":"USD","list_rate":"6.40","list_currency":"USD","billing_type":"easypost","delivery_days":3,"delivery_date":null,"delivery_date_guaranteed":false,"est_delivery_days":3,"shipment_id":"shp_c1bfabbf012845fca34e61aa50ad0d19","carrier_account_id":"ca_8dc116debcdb49b5a66a2ddee4612600"},"tracker":{"id":"trk_a432feb8a7374b5badb573ae10e3af75","object":"Tracker","mode":"test","tracking_code":"9400100105807075196603","status":"unknown","status_detail":"unknown","created_at":"2024-08-14T17:39:21Z","updated_at":"2024-08-14T17:39:21Z","signed_by":null,"weight":null,"est_delivery_date":null,"shipment_id":"shp_c1bfabbf012845fca34e61aa50ad0d19","carrier":"USPS","tracking_details":[],"fees":[],"carrier_detail":null,"public_url":"https:\/\/track.easypost.com\/djE6dHJrX2E0MzJmZWI4YTczNzRiNWJhZGI1NzNhZTEwZTNhZjc1"},"to_address":{"id":"adr_2373157f5a6411efb79f3cecef1b359e","object":"Address","created_at":"2024-08-14T17:39:20+00:00","updated_at":"2024-08-14T17:39:21+00:00","name":"JACK SPARROW","company":null,"street1":"388 TOWNSEND ST APT 20","street2":"","city":"SAN FRANCISCO","state":"CA","zip":"94107-1670","country":"US","phone":"<REDACTED>","email":"<REDACTED>","mode":"test","carrier_facility":null,"residential":true,"federal_tax_id":null,"state_tax_id":null,"verifications":{"zip4":{"success":true,"errors":[],"details":null},"delivery":{"success":true,"errors":[],"details":{"latitude":37.77551,"longitude":-122.39697,"time_zone":"America\/Los_Angeles"}}}},"usps_zone":4,"return_address":{"id":"adr_2376e09c5a6411efb7a23cecef1b359e","object":"Address","created_at":"2024-08-14T17:39:20+00:00","updated_at":"2024-08-14T17:39:20+00:00","name":"Elizabeth Swan","company":null,"street1":"179 N Harbor Dr","street2":null,"city":"Redondo Beach","state":"CA","zip":"90277","country":"US","phone":"<REDACTED>","email":"<REDACTED>","mode":"test","carrier_facility":null,"residential":null,"federal_tax_id":null,"state_tax_id":null,"verifications":[]},"buyer_address":{"id":"adr_2373157f5a6411efb79f3cecef1b359e","object":"Address","created_at":"2024-08-14T17:39:20+00:00","updated_at":"2024-08-14T17:39:21+00:00","name":"JACK SPARROW","company":null,"street1":"388 TOWNSEND ST APT 20","street2":"","city":"SAN FRANCISCO","state":"CA","zip":"94107-1670","country":"US","phone":"<REDACTED>","email":"<REDACTED>","mode":"test","carrier_facility":null,"residential":true,"federal_tax_id":null,"state_tax_id":null,"verifications":{"zip4":{"success":true,"errors":[],"details":null},"delivery":{"success":true,"errors":[],"details":{"latitude":37.77551,"longitude":-122.39697,"time_zone":"America\/Los_Angeles"}}}},"forms":[],"fees":[{"object":"Fee","type":"LabelFee","amount":"0.00000","charged":true,"refunded":false},{"object":"Fee","type":"PostageFee","amount":"5.93000","charged":true,"refunded":false},{"object":"Fee","type":"InsuranceFee","amount":"0.50000","charged":true,"refunded":false}],"id":"shp_c1bfabbf012845fca34e61aa50ad0d19","object":"Shipment"}'
        curl_info:
            url: 'https://api.easypost.com/v2/shipments'
            content_type: 'application/json; charset=utf-8'
            http_code: 201
            header_size: 760
            request_size: 871
            filetime: -1
            ssl_verify_result: 0
            redirect_count: 0
            total_time: 1.125973
            namelookup_time: 0.002535
            connect_time: 0.031976
            pretransfer_time: 0.064145
            size_upload: 563.0
            size_download: 6549.0
            speed_download: 5816.0
            speed_upload: 500.0
            download_content_length: 6549.0
            upload_content_length: 563.0
            starttransfer_time: 1.125874
            redirect_time: 0.0
            redirect_url: ''
            primary_ip: 169.62.110.130
            certinfo: {  }
            primary_port: 443
            local_ip: 192.168.1.75
            local_port: 52634
            http_version: 2
            protocol: 2
            ssl_verifyresult: 0
            scheme: https
            appconnect_time_us: 64084
            connect_time_us: 31976
            namelookup_time_us: 2535
            pretransfer_time_us: 64145
            redirect_time_us: 0
            starttransfer_time_us: 1125874
            total_time_us: 1125973
            effective_method: POST
            capath: ''
            cainfo: ''
    index: 0
-
    request:
        method: GET
        url: 'https://api.easypost.com/v2/shipments/shp_c1bfabbf012845fca34e61aa50ad0d19'
        headers:
            Host: api.easypost.com
            Accept-Encoding: ''
            Accept: application/json
            Authorization: ''
            Content-Type: application/json
            User-Agent: ''
    response:
        status:
            code: 200
            message: OK
        headers:
            x-frame-options: SAMEORIGIN
            x-xss-protection: '1; mode=block'
            x-content-type-options: nosniff
            x-download-options: noopen
            x-permitted-cross-domain-policies: none
            referrer-policy: strict-origin-when-cross-origin
            x-ep-request-uuid: e181587c66bcebcae2b8fb570086c98c
            cache-control: 'private, no-cache, no-store'
            pragma: no-cache
            expires: '0'
            content-type: 'application/json; charset=utf-8'
            content-length: '7679'
            x-runtime: '0.162016'
            x-node: bigweb34nuq
            x-version-label: easypost-202408141633-8ef9a7bcc9-master
            x-backend: easypost
            x-proxied: ['intlb3nuq c0f5e722d1', 'extlb2nuq b6e1b5034c']
            strict-transport-security: 'max-age=31536000; includeSubDomains; preload'
        body: '{"created_at":"2024-08-14T17:39:21Z","is_return":false,"messages":[],"mode":"test","options":{"currency":"USD","payment":{"type":"SENDER"},"date_advance":0},"reference":null,"status":"unknown","tracking_code":"9400100105807075196603","updated_at":"2024-08-14T17:39:21Z","batch_id":null,"batch_status":null,"batch_message":null,"customs_info":null,"from_address":{"id":"adr_2376e09c5a6411efb7a23cecef1b359e","object":"Address","created_at":"2024-08-14T17:39:20+00:00","updated_at":"2024-08-14T17:39:20+00:00","name":"Elizabeth Swan","company":null,"street1":"179 N Harbor Dr","street2":null,"city":"Redondo Beach","state":"CA","zip":"90277","country":"US","phone":"<REDACTED>","email":"<REDACTED>","mode":"test","carrier_facility":null,"residential":null,"federal_tax_id":null,"state_tax_id":null,"verifications":[]},"insurance":"50.00","order_id":null,"parcel":{"id":"prcl_6590bfc884a3414aa2cf33d6d018f058","object":"Parcel","created_at":"2024-08-14T17:39:21Z","updated_at":"2024-08-14T17:39:21Z","length":10,"width":8,"height":4,"predefined_package":null,"weight":15.4,"mode":"test"},"postage_label":{"object":"PostageLabel","id":"pl_c371b9a83d2e40828f977234bff49444","created_at":"2024-08-14T17:39:21Z","updated_at":"2024-08-14T17:39:21Z","date_advance":0,"integrated_form":"none","label_date":"2024-08-14T17:39:21Z","label_resolution":300,"label_size":"4x6","label_type":"default","label_file_type":"image\/png","label_url":"https:\/\/easypost-files.s3.us-west-2.amazonaws.com\/files\/postage_label\/20240814\/e84524d20967dd4c589363e13df3322730.png","label_pdf_url":null,"label_zpl_url":null,"label_epl2_url":null,"label_file":null},"rates":[{"id":"rate_42d52c8debaa407aa90dda98e42f9aba","object":"Rate","created_at":"2024-08-14T17:39:21Z","updated_at":"2024-08-14T17:39:21Z","mode":"test","service":"GroundAdvantage","carrier":"USPS","rate":"5.93","currency":"USD","retail_rate":"8.45","retail_currency":"USD","list_rate":"6.40","list_currency":"USD","billing_type":"easypost","delivery_days":3,"delivery_date":null,"delivery_date_guaranteed":false,"est_delivery_days":3,"shipment_id":"shp_c1bfabbf012845fca34e61aa50ad0d19","carrier_account_id":"ca_8dc116debcdb49b5a66a2ddee4612600"},{"id":"rate_5bb7787808c24d1eafda6bf31e477564","object":"Rate","created_at":"2024-08-14T17:39:21Z","updated_at":"2024-08-14T17:39:21Z","mode":"test","service":"Express","carrier":"USPS","rate":"33.10","currency":"USD","retail_rate":"37.90","retail_currency":"USD","list_rate":"33.10","list_currency":"USD","billing_type":"easypost","delivery_days":1,"delivery_date":null,"delivery_date_guaranteed":false,"est_delivery_days":1,"shipment_id":"shp_c1bfabbf012845fca34e61aa50ad0d19","carrier_account_id":"ca_8dc116debcdb49b5a66a2ddee4612600"},{"id":"rate_b77ef8611454491ca817c5633216d5a9","object":"Rate","created_at":"2024-08-14T17:39:21Z","updated_at":"2024-08-14T17:39:21Z","mode":"test","service":"Priority","carrier":"USPS","rate":"6.90","currency":"USD","retail_rate":"9.80","retail_currency":"USD","list_rate":"8.25","list_currency":"USD","billing_type":"easypost","delivery_days":2,"delivery_date":null,"delivery_date_guaranteed":false,"est_delivery_days":2,"shipment_id":"shp_c1bfabbf012845fca34e61aa50ad0d19","carrier_account_id":"ca_8dc116debcdb49b5a66a2ddee4612600"}],"refund_status":null,"scan_form":null,"selected_rate":{"id":"rate_42d52c8debaa407aa90dda98e42f9aba","object":"Rate","created_at":"2024-08-14T17:39:21Z","updated_at":"2024-08-14T17:39:21Z","mode":"test","service":"GroundAdvantage","carrier":"USPS","rate":"5.93","currency":"USD","retail_rate":"8.45","retail_currency":"USD","list_rate":"6.40","list_currency":"USD","billing_type":"easypost","delivery_days":3,"delivery_date":null,"delivery_date_guaranteed":false,"est_delivery_days":3,"shipment_id":"shp_c1bfabbf012845fca34e61aa50ad0d19","carrier_account_id":"ca_8dc116debcdb49b5a66a2ddee4612600"},"tracker":{"id":"trk_a432feb8a7374b5badb573ae10e3af75","object":"Tracker","mode":"test","tracking_code":"9400100105807075196603","status":"pre_transit","status_detail":"status_update","created_at":"2024-08-14T17:39:22Z","updated_at":"2024-08-14T17:39:22Z","signed_by":null,"weight":null,"est_delivery_date":"2024-08-14T17:39:22Z","shipment_id":"shp_c1bfabbf012845fca34e61aa50ad0d19","carrier":"USPS","tracking_details":[{"object":"TrackingDetail","message":"Pre-Shipment Info Sent to USPS","description":"","status":"pre_transit","status_detail":"status_update","datetime":"2024-07-14T17:39:22Z","source":"USPS","carrier_code":"","tracking_location":{"object":"TrackingLocation","city":null,"state":null,"country":null,"zip":null}},{"object":"TrackingDetail","message":"Shipping Label Created","description":"","status":"pre_transit","status_detail":"status_update","datetime":"2024-07-15T06:16:22Z","source":"USPS","carrier_code":"","tracking_location":{"object":"TrackingLocation","city":"HOUSTON","state":"TX","country":null,"zip":"77063"}}],"fees":[],"carrier_detail":{"object":"CarrierDetail","service":"First-Class Package Service","container_type":null,"est_delivery_date_local":null,"est_delivery_time_local":null,"origin_location":"HOUSTON TX, 77001","origin_tracking_location":{"object":"TrackingLocation","city":"HOUSTON","state":"TX","country":null,"zip":"77063"},"destination_location":"CHARLESTON SC, 29401","destination_tracking_location":null,"guaranteed_delivery_date":null,"alternate_identifier":null,"initial_delivery_attempt":null},"public_url":"https:\/\/track.easypost.com\/djE6dHJrX2E0MzJmZWI4YTczNzRiNWJhZGI1NzNhZTEwZTNhZjc1"},"to_address":{"id":"adr_2373157f5a6411efb79f3cecef1b359e","object":"Address","created_at":"2024-08-14T17:39:20+00:00","updated_at":"2024-08-14T17:39:21+00:00","name":"JACK SPARROW","company":null,"street1":"388 TOWNSEND ST APT 20","street2":null,"city":"SAN FRANCISCO","state":"CA","zip":"94107-1670","country":"US","phone":"<REDACTED>","email":"<REDACTED>","mode":"test","carrier_facility":null,"residential":true,"federal_tax_id":null,"state_tax_id":null,"verifications":{"zip4":{"success":true,"errors":[],"details":null},"delivery":{"success":true,"errors":[],"details":{"latitude":37.77551,"longitude":-122.39697,"time_zone":"America\/Los_Angeles"}}}},"usps_zone":4,"return_address":{"id":"adr_2376e09c5a6411efb7a23cecef1b359e","object":"Address","created_at":"2024-08-14T17:39:20+00:00","updated_at":"2024-08-14T17:39:20+00:00","name":"Elizabeth Swan","company":null,"street1":"179 N Harbor Dr","street2":null,"city":"Redondo Beach","state":"CA","zip":"90277","country":"US","phone":"<REDACTED>","email":"<REDACTED>","mode":"test","carrier_facility":null,"residential":null,"federal_tax_id":null,"state_tax_id":null,"verifications":[]},"buyer_address":{"id":"adr_2373157f5a6411efb79f3cecef1b359e","object":"Address","created_at":"2024-08-14T17:39:20+00:00","updated_at":"2024-08-14T17:39:21+00:00","name":"JACK SPARROW","company":null,"street1":"388 TOWNSEND ST APT 20","street2":null,"city":"SAN FRANCISCO","state":"CA","zip":"94107-1670","country":"US","phone":"<REDACTED>","email":"<REDACTED>","mode":"test","carrier_facility":null,"residential":true,"federal_tax_id":null,"state_tax_id":null,"verifications":{"zip4":{"success":true,"errors":[],"details":null},"delivery":{"success":true,"errors":[],"details":{"latitude":37.77551,"longitude":-122.39697,"time_zone":"America\/Los_Angeles"}}}},"forms":[],"fees":[{"object":"Fee","type":"LabelFee","amount":"0.00000","charged":true,"refunded":false},{"object":"Fee","type":"PostageFee","amount":"5.93000","charged":true,"refunded":false},{"object":"Fee","type":"InsuranceFee","amount":"0.50000","charged":true,"refunded":false}],"id":"shp_c1bfabbf012845fca34e61aa50ad0d19","object":"Shipment"}'
        curl_info:
            url: 'https://api.easypost.com/v2/shipments/shp_c1bfabbf012845fca34e61aa50ad0d19'
            content_type: 'application/json; charset=utf-8'
            http_code: 200
            header_size: 689
            request_size: 323
            filetime: -1
            ssl_verify_result: 0
            redirect_count: 0
            total_time: 0.255229
            namelookup_time: 0.001188
            connect_time: 0.030087
            pretransfer_time: 0.061072
            size_upload: 0.0
            size_download: 7679.0
            speed_download: 30086.0
            speed_upload: 0.0
            download_content_length: 7679.0
            upload_content_length: 0.0
            starttransfer_time: 0.255085
            redirect_time: 0.0
            redirect_url: ''
            primary_ip: 169.62.110.130
            certinfo: {  }
            primary_port: 443
            local_ip: 192.168.1.75
            local_port: 52637
            http_version: 2
            protocol: 2
            ssl_verifyresult: 0
            scheme: https
            appconnect_time_us: 61038
            connect_time_us: 30087
            namelookup_time_us: 1188
            pretransfer_time_us: 61072
            redirect_time_us: 0
            starttransfer_time_us: 255085
            total_time_us: 255229
            effective_method: GET
            capath: ''
            cainfo: ''
    index: 0
-
    request:
        method: POST
        url: 'https://api.easypost.com/v2/refunds'
        headers:
            Host: api.easypost.com
            Expect: ''
            Accept-Encoding: ''
            Accept: application/json
            Authorization: ''
            Content-Type: application/json
            User-Agent: ''
        body: '{"refund":{"carrier":"USPS","tracking_codes":["9400100105807075196603"]}}'
    response:
        status:
            code: 201
            message: Created
        headers:
            x-frame-options: SAMEORIGIN
            x-xss-protection: '1; mode=block'
            x-content-type-options: nosniff
            x-download-options: noopen
            x-permitted-cross-domain-policies: none
            referrer-policy: strict-origin-when-cross-origin
            x-ep-request-uuid: e181587866bcebcae2b8fb580086c9cf
            cache-control: 'private, no-cache, no-store'
            pragma: no-cache
            expires: '0'
            content-type: 'application/json; charset=utf-8'
            content-length: '297'
            x-runtime: '0.075319'
            x-node: bigweb32nuq
            x-version-label: easypost-202408141633-8ef9a7bcc9-master
            x-backend: easypost
            x-canary: direct
            x-proxied: ['intlb3nuq c0f5e722d1', 'extlb2nuq b6e1b5034c']
            strict-transport-security: 'max-age=31536000; includeSubDomains; preload'
        body: '[{"id":"rfnd_1513d464240f447bae0485a6ac447379","object":"Refund","created_at":"2024-08-14T17:39:22Z","updated_at":"2024-08-14T17:39:22Z","tracking_code":"9400100105807075196603","confirmation_number":null,"status":"submitted","carrier":"USPS","shipment_id":"shp_c1bfabbf012845fca34e61aa50ad0d19"}]'
        curl_info:
            url: 'https://api.easypost.com/v2/refunds'
            content_type: 'application/json; charset=utf-8'
            http_code: 201
            header_size: 711
            request_size: 378
            filetime: -1
            ssl_verify_result: 0
            redirect_count: 0
            total_time: 0.184307
            namelookup_time: 0.004849
            connect_time: 0.038103
            pretransfer_time: 0.07295
            size_upload: 73.0
            size_download: 297.0
            speed_download: 1611.0
            speed_upload: 396.0
            download_content_length: 297.0
            upload_content_length: 73.0
            starttransfer_time: 0.184275
            redirect_time: 0.0
            redirect_url: ''
            primary_ip: 169.62.110.130
            certinfo: {  }
            primary_port: 443
            local_ip: 192.168.1.75
            local_port: 52638
            http_version: 2
            protocol: 2
            ssl_verifyresult: 0
            scheme: https
            appconnect_time_us: 72911
            connect_time_us: 38103
            namelookup_time_us: 4849
            pretransfer_time_us: 72950
            redirect_time_us: 0
            starttransfer_time_us: 184275
            total_time_us: 184307
            effective_method: POST
            capath: ''
            cainfo: ''
    index: 0
